# Data Analysis
# Practical 9

# Usual Data loading and processing steps
### Import the libraries

In [21]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Read the dataset

In [22]:
kerala_floods = pd.read_csv('kerala_floods.csv')
kerala_floods.head(10)

,SUBDIVISION,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL RAINFALL,FLOODS
0,KERALA,1901,28.7,44.7,51.6,160.0,174.7,824.6,743.0,357.5,197.7,266.9,350.8,48.4,3248.6,YES
1,KERALA,1902,6.7,2.6,57.3,83.9,134.5,390.9,1205.0,315.8,491.6,358.4,158.3,121.5,3326.6,YES
2,KERALA,1903,3.2,18.6,3.1,83.6,249.7,558.6,1022.5,420.2,341.8,354.1,157.0,59.0,3271.2,YES
3,KERALA,1904,23.7,3.0,32.2,71.5,235.7,1098.2,725.5,351.8,222.7,328.1,33.9,3.3,3129.7,YES
4,KERALA,1905,1.2,22.3,9.4,105.9,263.3,850.2,520.5,293.6,217.2,383.5,74.4,0.2,2741.6,NO
5,KERALA,1906,26.7,7.4,9.9,59.4,160.8,414.9,954.2,442.8,131.2,251.7,163.1,86.0,2708.0,NO
6,KERALA,1907,18.8,4.8,55.7,170.8,101.4,770.9,760.4,981.5,225.0,309.7,219.1,52.8,3671.1,YES
7,KERALA,1908,8.0,20.8,38.2,102.9,142.6,592.6,902.2,352.9,175.9,253.3,47.9,11.0,2648.3,NO
8,KERALA,1909,54.1,11.8,61.3,93.8,473.2,704.7,782.3,258.0,195.4,212.1,171.1,32.3,3050.2,YES
9,KERALA,1910,2.7,25.7,23.3,124.5,148.8,680.0,484.1,473.8,248.6,356.6,280.4,0.1,2848.6,NO

## Size of the dataset

In [23]:
kerala_floods.shape

(118, 16)

## Missing values

In [24]:
kerala_floods.isna().sum()

SUBDIVISION         0
YEAR                0
JAN                 0
FEB                 0
MAR                 0
APR                 0
MAY                 0
JUN                 0
JUL                 0
AUG                 0
SEP                 0
OCT                 0
NOV                 0
DEC                 0
 ANNUAL RAINFALL    0
FLOODS              0
dtype: int64

# 1 - New column JUNE_MORE_THAN_500

In [25]:
kerala_floods['JUNE_MORE_THAN_500'] = (kerala_floods['JUN'] > 500).astype(int)

In [26]:
kerala_floods['JUNE_MORE_THAN_500'].value_counts()

JUNE_MORE_THAN_500
1    93
0    25
Name: count, dtype: int64

# 2 - Updates to the column 'FLOODS'

In [27]:
kerala_floods['FLOODS'].value_counts()

FLOODS
YES    60
NO     58
Name: count, dtype: int64

In [28]:
kerala_floods['FLOODS'] = (kerala_floods['FLOODS'] == 'YES').astype(int)

In [29]:
kerala_floods['FLOODS'].value_counts()

FLOODS
1    60
0    58
Name: count, dtype: int64

# 3 - Select needed columns

In [30]:
kerala_floods[['JUNE_MORE_THAN_500', 'FLOODS']]

     JUNE_MORE_THAN_500  FLOODS
0                     1       1
1                     0       1
2                     1       1
3                     1       1
4                     1       0
..                  ...     ...
113                   0       1
114                   1       0
115                   1       0
116                   0       0
117                   1       1

[118 rows x 2 columns]

# 3 - Crosstab between these two columns: FLOODS, JUNE_MORE_THA_500

In [31]:
crosstab = pd.crosstab(kerala_floods['JUNE_MORE_THAN_500'], kerala_floods['FLOODS'])

In [32]:
crosstab

FLOODS               0   1
JUNE_MORE_THAN_500
0                   19   6
1                   39  54

# P(JUNE_MORE_THAN_500) = ? 
## So, it is crystal clear that the answer is 54/(19+6+39+54), but should I do it in the terms of code?

In [45]:
june_more_than_500 = kerala_floods['JUNE_MORE_THAN_500'].value_counts()[1] 
june_more_than_500

np.int64(93)

In [44]:
all_june = kerala_floods['JUNE_MORE_THAN_500'].count()
all_june

np.int64(118)